# GetProjection

## Description
Returns the projection index from the specified layer.

```pascal
FUNCTION GetProjection(theyLayer : HANDLE) : INTEGER;
```

```python

def vs.GetProjection(theyLayer):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|theyLayer|HANDLE|Layer which the projection is returned for.|

## Version
Availability: from VectorWorks 2008
## Category
* View / Zoom